#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # proxmox_vm_qemu.cloudflare-tunnel will be created
  + resource "proxmox_vm_qemu" "cloudflare-tunnel" {
      + additional_wait           = 5
      + automatic_reboot          = true
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = (known after apply)
      + bootdisk                  = (known after apply)
      + bridge                    = "evnet1"
      + clone                     = "ubuntu2204-withdocker"
      + clone_wait                = 10
      + cores                     = 3
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = true
      + desc                      = "cloudflare"
      + disk_gb                   = 8
      + force_create              = false
      + full_clone                = true
      + guest_agent_ready_timeout = 100
      + hotplug                   = "network,disk,usb"
      + id                        = (known after apply)
      + ipconfig0                 = "ip=10.0.0.50/24,gw=10.0.0.1"
      + kvm                       = true
      + memory                    = 2000
      + name                      = "cloudflare-tunnel"
      + nameserver                = (known after apply)
      + nic                       = "virtio"
      + onboot                    = false
      + oncreate                  = true
      + os_type                   = "cloud-init"
      + pool                      = "solufit"
      + preprovision              = true
      + reboot_required           = (known after apply)
      + scsihw                    = "lsi"
      + searchdomain              = (known after apply)
      + sockets                   = 1
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + storage                   = "local-lvm"
      + tablet                    = true
      + target_node               = "milky-capella"
      + unused_disk               = (known after apply)
      + vcpus                     = 0
      + vlan                      = -1
      + vmid                      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with proxmox_vm_qemu.cloudflare-tunnel,
  on cft.tf line 13, in resource "proxmox_vm_qemu" "cloudflare-tunnel":
  13:   storage = "local-lvm"

Use `disk.storage` instead

(and 7 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Walkmana-25, Action: `pull_request`*